{"pageProps":{"title":"Projects and tasks","content":"My approach to projects and tasks is inspired by David Allen's GTD system. \n\n#### Key principles\nThere are 3 key principles I follow:\n1.  I have a written list of **projects and areas of interest**. Every day I read the list and think which next action I can do to be closer to finishing a project or maintain an area of interest. I mark such next actions with **#today**, **#tomorrow**, or **#later** tag.\n2.  I have a written list called **Inbox** to save all purchases, interesting articles, videos, etc. Every day I check the Inbox list and either move an item to some project or delete it.\n3.  If I'm not sure that I want to do something I add **#idea** tag to the item.\n\n#### Tool\nI use [Workflowy →](https://workflowy.com/hello) application to work with the lists I described above. There are the following useful features:\n\n1.  Workflowy is installed on my laptop, mobile and tablet. It is synchronized automatically. I can use it everywhere.\n2.  Workflowy allows to search by a tag. It means I can create a quick view with daily tasks or a similar view.\n3.  Workflowy allows to focus on a list and show only the list's items.\n4.  I can use hotkeys to work with Workflowy. Usually, I don't use a mouse/touchpad.\n\nHere is a [short video](https://www.youtube.com/watch?v=TOCXpTKn8_Y) how I use Workflowy for project and task management.\n\n#### Keyboard shortcuts\n1.  Cmd+F to search everywhere (sends <Cmd+K> with Karabiner - I remapped the shortcut).\n2.  Escape to search in the scope of a current node.\n3.  Cmd+. to zoom in into a current node (makes it full-screen).\n4.  Cmd+, to zoom out (goes to a parent node).\n5.  Cmd+Shift+J expands current node.\n6.  Cmd+Shift+K collapse current node.\n7.  Cmd+Enter mark current node as completed.\n8.  Cmd+Shift+Backspace delete current node.\n\n#### See also\n- [Short video how I use Workflowy for project and task management](https://www.youtube.com/watch?v=TOCXpTKn8_Y)\n\n#### Related notes\n- [About me &rarr;](/notes/About%20me)\n"},"__N_SSG":true}