{"pageProps":{"title":"Ontology","content":"These are my notes from ontology course.\n\n### 1. Types\nEvery object has a type. Type defines what we can do with the object.\n\n- Physical object: has 4d representation in space and time, object is finite.\n- Class: a set of objects which are grouped using some property value.\n- Tuple: it's 3 items: object, relation, another object. Order is important.\n\nDon't forget to clarify what this word is referring to. It may be a source for an error: you may use the same word as your colleague but have a different object in your mind.\n\n\n### 2. Explanation\nDesired properties of an explanation:\n1. It is close to reality: we can explain something with narrow classes or physical objects.\n2. It has details.\n3. Refutability: we know in which circumstances our explanation will be false. The more such ways we find the better. To find the ways we need to answer the following question: what should happen to make our explanation false?\n\nMnemonic technique: it's easier to remember facts if we put the facts into a narrative (story): *somebody* doing *something*. Something is your facts.\n\n\n### 3. Roles\nEach role has:\n1. Objects of interest: what objects are picked out from background.\n2. Preferences.\n3. Intentions: what the role is going to do with its objects of interest to satisfy its preferences.\n\n\n### 4. Goal-oriented communication\n#### 4.1. Think pragmatically\nThe main idea is to think about communication pragmatically. It means to define a goal  for your communication. It may be:\n- to make this amount of fun\n- to socialise\n- to solve a specific problem\n\n#### 4.2. Think from one role\nIt means you need to understand your objects of interest, preferences and you are going to act according to the preferences.\n\n#### 4.3. Think about your partner's role\nYou need to understand your partner's objects of interest, preferences and what they are going to do about it.\n\n#### 4.4. Both parties need to agree about their communication goal\nAnd they need to do according to the goal, not to something else.\n\n#### 4.5. Amount of information and its relevance to the goal\nThere may be too many or too small information and that's why it may be difficult to understand all. Also some information may be not relevant to the goal and hence must be omitted. \n\n#### 4.6. Quality of information and its truthyness\n\n#### 4.7. Make sure you both refer to the same objects\nIt make sense to agree about terms if you talk about new topic.\n\n\n### 5. Communication failures\n#### 5. 1. Communication was ended by another person\n- goal is not clear for another person: talk about what another person wants from the communication.\n- goal is clear for another person but it's value is less than efforts: ask another person if it's true.\n- another person lost their attention: give them time to recover.\n\n#### 5.2. Communication is continuing but you haven't reached your goal\n- *you* have an illusion of a common goal: talk if you have a common goal.\n- another person changes their role: need to ask which role are they playing at the moment or ask if they are talking from *this* role; you may also ask what is the most interesting things for them here.\n- object of communication is not clear or language is not clear: talk about what these words reference to.\n\n\n### See also\n- [Chris Partridge: # Business Objects: Re-Engineering for Re-Use](https://www.amazon.com/Business-Objects-Re-Engineering-Computer-Professional/dp/075062082X)\n- [David Deutsch: The Fabric of Reality: The Science of Parallel Universes--and Its Implications](https://www.amazon.com/Fabric-Reality-Parallel-Universes-Implications/dp/014027541X)\n\n### Related links\n- [Life &rarr;](/notes/Life)"},"__N_SSG":true}