{"pageProps":{"title":"Redis","content":"#### What it is\nRedis is an in-memory database. Usually it is used as a secondary database.\n\n#### Use cases\n1. Cache.\n2. Queue.\n3. Message broker.\n4. Rate-limiter.\n5. Atomic counters.\n\n#### Protocol\nRedis uses a simple text protocol for issuing and receiving commands.\n\n#### Implementation\nRedis uses a single thread to execute commands. It is a design choice.\n\n#### Transactions\nIt is NOT the same transaction as in a relational database. If one command in a transaction fails all the other transactions WILL be executed (there is no rollback).\n\nUsing \"Multi, commands list, Exec\" Redis guarantees that these commands will be run one after another and all other commands will be run either before or after the commands.\n\nMulti starts queuing consequent commands. Exec runs their execution.\n\nWATCH in combination with EXEC is used for optimistic locking. If one of watched keys was modified EXEC will fail.\n\n[Transactions](https://redis.io/topics/transactions)\n\n#### Message broker\nWe can send a message to a channel. One channel has several subscribers. Commands are: subscribe, unsubscribe and publish.\n\n#### Special data types\nBitmap for bit operations to save memory.\nHyperLogLog for probabalistic counting of unique elements in a set to save memory.\n\n#### Storage\nRedis database snapshots (RDB):\nStores data in-memory and saves the memory snapshot to disk from time to time as an RDB file. It uses forked process to create a snapshot, so it does not affect performace of the original process. Fork uses copy-on-write, so it is fast.\n\nAppend-only file (AOF):\nWrites all commands issued against the Redis server. The file will be big because one value stored is only once but may be modified many times (there is a command to rewrite the file when it becomes too big). Durability depends how often you call fsync.\n\nRestoring from RDB snapshot is faster than applying AOF.\n\n[Append-only file](https://redis.io/topics/persistence#append-only-file)\n\n[Redis persistence demystified](http://oldblog.antirez.com/post/redis-persistence-demystified.html)\n\n#### Roundtrip time (RTT) and pipelinening\nWhen a command is sent the client is blocked until we get a response from the redis server. If we want to avoid the roundtrip time we need to send all commands at a time or use batches. This feature is called pipelining.\n\n#### Availability and failover\nRedis uses replicas to support high availability.\nWe need one primary node, one replica and at least 3 Sentinel instances to have a quorum. Sentinel instances may be run on the same machine as Redis. For big installations we may want to have 2 big Redis machines and 3 small Sentinel machines.\nRedis uses asynchronous replication: if master fails then replica may be slightly outdated.\n\nRedis uses shards to scale horizontally. Cluster is a collection of shards.\n\n#### Operating system support\n1. Linux is recommended.\n2. Mac OS.\n\n#### Related notes\n- [Engineering &rarr;](/notes/Engineering)"},"__N_SSG":true}