{"pageProps":{"title":"Storage and retrieval","content":"### Tradeoff between writing and reading speed\nThe fastest way to save data is to write it to a flat file. The problem is that we will have to full scan the file to make a query.\n\nTo make retieval faster we need to write data in such a way to not petform a full scan.\n\nThe example below has a very good writing speed but uses a sequential scan for search and therefore it's slow.\n```bash\nset () {\n echo \"$1,$2\" >> file\n}\n\nget () {\n grep \"^$1,\" file | sed -e \"s/^$1,//\" | tail -n 1\n}\n```\n\n#### Segments\nWhen we update a record in a database we can save the whole new value again and again. At some point of time we can delete obsolete values and compact our file. That's why we need segments: we always write to the latest segment and another process may compress previous segment.\n\nIf segments are append only we will have less bugs because we can write using one process and read using multiple processes.\n\nUsually a segment is several megabytes in size or more.\n\n#### Indexes\nIndexes are used to speedup reading if we need a subset of data.\n\n#### Hash indexes\nWe can store keys in RAM in a hashmap and point (as byte offset) to values on a disk.\nIf we reboot we will need to reread segment files to restore the index in RAM.\n\n#### SS-tables and LSM-trees\nSorted string table has keys ordered in each segment and each key may exist at most once in each segment. Such segments are efficiently sorted with mergesort. SS-table may store either key with value or key with offset to a file with data. SS-table is immutable when it is stored on disk.\n\nWe can also create an in-memory index for segment files and it will require much less memory because we need to keep only a subset of the keys (assuming that reading several kb is cheap).\n\nLog-structured merge tree (LSM tree) is a cascade of SS-tables that are merging in background.\n\nBloom filter is used to quickly check if a given key exists in the database.\n\nExamples: LevelDB, RocksDB, Lucene.\n\n#### B-trees\nB-tree breaks a database index into pages of about 4Kb in size. This is a smallest block which can be effectively read or written.\n\nEach page may refer to several other pages on disk.\n\nTo make a safe b-tree update like a page split we need to use write ahead log.\n\nExamples: almost any relational database.\n\n#### LSM-trees vs B-trees\nLSM-trees are faster for writing operations.\nB-trees are faster for reading operations.\n\n#### Layers\nAs we can see usually databases are implemented in several layers: they use such approaches as background merges or changelog to improve performance/reliablity.\n\n#### OLTP vs OLAP\nOLTP is usually used to run many low latency queries.\nOLAP is usually used to run a small number of long-running queries.\n\nOLAP database is usually filled from OLTP database. OLAP databases also called warehouses. They usually have star schema or snowflake schema: facts table with many related detail tables.\n\n#### Column-oriented storage\nRelational databases usually store all row fields together. If we need to access only a small number of fields in one query we can store values from each column together. This is useful for OLAP.\n\n#### Bitmap storage\nIf we want to store country then we need about 200 values. We can create 200 bitmaps where 1 means value of a given country and 0 means it is not. These  bitmaps may be compressed too.\n"},"__N_SSG":true}